app/controllers/quotes_controller.rb

SELECT  "quotes".* FROM "quotes" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
---
  def index

    #@quote = Quote.first
    @quote = Quote.order("RANDOM()").first

INSERT INTO "quotes" ("saying", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["saying", "Blessed are the merciful, for they will be shown mercy."], ["author", "Jesus Christ"], ["created_at", "2019-08-15 02:01:32.945173"], ["updated_at", "2019-08-15 02:01:32.945173"]]
---
  def create
    @quote = Quote.create(quote_params)